<template>
    <div class="users-agreement">
        <BaseHeading class="users-agreement__heading">Пользовательское соглашение</BaseHeading>
        <div class="users-agreement__text">
            <section class="users-agreement__main">
                <h2 class="users-agreement__section-heading">Введение</h2>
                <p>
                    Обеспечение конфиденциальности и безопасности обработки персональных данных в Компании является одной из приоритетных задач организации.
                    В Компании для этих целей введен в действие комплект организационно-распорядительной документации, обязательный к исполнению всеми сотрудниками, допущенными к обработке персональных данных.
                    Обработка, хранение и обеспечение конфиденциальности и безопасности персональных данных осуществляется в соответствии с действующим законодательством РФ в сфере защиты персональных данных, и в соответствии с локальными актами Компании.
                    Настоящая Политика определяет принципы, порядок и условия обработки персональных данных работников Компании и потребителей услуг Компании, чьи персональные данные обрабатываются организацией, с целью обеспечения защиты прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну, а также устанавливает ответственность должностных лиц Компании, имеющих доступ к персональным данным, за невыполнение требований норм, регулирующих обработку и защиту персональных данных.
                    Настоящая Политика в отношении обработки персональных данных в Компании (далее - Политика) разработана в соответствии с Федеральным законом от 27 июля 2006 г. № 152-ФЗ «О персональных данных».
                </p>
                <p>Компания осуществляет обработку персональных данных в следующих целях:</p>
                <ul class="users-agreement__list">
                    <li>
                        организации кадрового учета компании;
                    </li>
                    <li>
                        обеспечения соблюдения законов и иных нормативно-правовых актов;
                    </li>
                    <li>
                        ведения кадрового делопроизводства;
                    </li>
                    <li>
                        исполнения требований налогового законодательства в связи с исчислением и уплатой налога на доходы физических лиц, а также единого социального налога, пенсионного законодательства при формировании и представлении персонифицированных данных о каждом получателе доходов, учитываемых при начислении страховых взносов на обязательное пенсионное страхование и обеспечение;
                    </li>
                    <li>
                        заполнения первичной статистической документации, в соответствии с Трудовым кодексом РФ, Налоговым кодексом РФ, федеральными законами, в частности: «Об индивидуальном (персонифицированном) учете в системе обязательного пенсионного страхования», «О персональных данных» и других нормативно-правовых актов;
                    </li>
                    <li>
                        исполнения договорных обязательств, в том числе гарантийного обслуживания потребителей услуг Компании;
                    </li>
                    <li>
                        иной деятельности в соответствии с Уставом Компании, действующим законодательством Российской федерации.
                    </li>
                </ul>
            </section>
            <section>
                <h2 class="users-agreement__section-heading">Сроки обработки персональных данных</h2>
                <p>
                    Сроки обработки персональных данных определяются в соответствие со сроком действия договора (соглашением) с субъектом персональных данных, сроком исковой давности, достижением целей обработки, а также иными требованиями законодательства РФ.
                    В Компании создаются и хранятся документы, содержащие сведения о субъектах персональных данных. Требования к использованию в Компании данных типовых форм документов установлены Постановлением Правительства РФ от 15.09.2008 № 687 «Об утверждении Положения об особенностях обработки персональных данных, осуществляемой без использования средств автоматизации».
                </p>
            </section>
            <section>
                <h2 class="users-agreement__section-heading">Права и обязанности</h2>
                <p>Компания как оператор персональных данных в праве:</p>
                <ul>
                    <li>отстаивать свои интересы в суде;</li>
                    <li>предоставлять персональные данные субъектов третьим лицам, если это предусмотрено действующим законодательством (налоговые, правоохранительные органы и др.) или соглашением субъекта персональных данных;</li>
                    <li>отказывать в предоставлении персональных данных в случаях предусмотренных действующим законодательством;</li>
                    <li>использовать персональные данные субъекта без его согласия, в случаях предусмотренных законодательством.</li>
                </ul>
                <p>Субъект персональных данных имеет право:</p>
                <ul>
                    <li>требовать уточнения своих персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, недостоверными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;</li>
                    <li>требовать перечень своих персональных данных, обрабатываемых Компанией и источник их получения;</li>
                    <li>получать информацию о сроках обработки своих персональных данных, в том числе о сроках их хранения;</li>
                    <li>требовать извещения всех лиц, которым ранее были сообщены неверные или неполные его персональные данные, обо всех произведенных в них исключениях, исправлениях или дополнениях;</li>
                    <li>обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействия при обработке его персональных данных.</li>
                </ul>
            </section>
        </div>
    </div>
</template>

<script setup>
import BaseHeading from '@/Shared/Components/BaseHeading/BaseHeading.vue';

</script>

<style lang="scss">
@import "@/Containers/Pages/UI/Assets/Scss/pages-text";
@import '@/Shared/Assets/Scss/container';

.users-agreement {
    @include site-container;
    @include pages-content;
}
</style>